#+Title: Usando firebase com cordova
#+Subtitle: projeto 1, basico do firebird


* Criando o projeto

  
   #+NAME:  cordova create cordovacomsqlite1 br.edu.eteczl.cordovacomsqlite1 "Cordova Com Sqlite"
   #+BEGIN_SRC shell :session s1 :results output :exports both
      #starts code
      cd $projetosDir
      cordova create cordovafirebase_emailauth br.edu.eteczl "Firebase Email Auth"
      export projDir=$projetosDir/cordovafirebase_emailauth
      ls -l $projDir
   #+END_SRC

   #+RESULTS: cordova create cordovacomsqlite1 br.edu.eteczl.cordovacomsqlite1 "Cordova Com Sqlite"
   #+begin_example

   [wagner@Unknown projetos]$ Creating a new cordova project.[0m
   [wagner@Unknown projetos]$ total 28
   -rw-rw-r--. 1 wagner wagner  989 abr 14 23:47 config.xml
   drwxrwxr-x. 2 wagner wagner 4096 abr 14 23:47 hooks
   -rw-rw-r--. 1 wagner wagner  371 abr 14 23:47 package.json
   drwxrwxr-x. 2 wagner wagner 4096 abr 14 23:47 platforms
   drwxrwxr-x. 2 wagner wagner 4096 abr 14 23:47 plugins
   drwxrwxr-x. 4 wagner wagner 4096 abr 14 23:47 res
   drwxrwxr-x. 5 wagner wagner 4096 abr 14 23:47 www
   #+end_example

* Instalando o plugin do sqlite e a plataforma android no projeto
  
   #+NAME:  cordova platform add browser
   #+BEGIN_SRC shell :session s1 :results output :exports both
      #starts code
      cd $projDir
      cordova platform add browser
      cordova run browser
   #+END_SRC

   #+RESULTS: cordova platform add browser
   #+begin_example

   [wagner@Unknown cordovafirebase_emailauth]$ Using cordova-fetch for cordova-browser@~5.0.1[0m
   Adding browser project...[0m
   Creating Cordova project for cordova-browser:[0m
           Path: /home/wagner/wagnerdocri@gmail.com3/envs/env-dev/sources/aulas_de_cordova/projetos/cordovafirebase_emailauth/platforms/browser[0m
           Name: Firebase Email Auth[0m
   Discovered plugin "cordova-plugin-whitelist" in config.xml. Adding it to the project[0m
   Installing "cordova-plugin-whitelist" for browser[0m
   Adding cordova-plugin-whitelist to package.json[0m
   Saved plugin info for "cordova-plugin-whitelist" to config.xml[0m
   --save flag or autosave detected[0m
   Saving browser@~5.0.4 into config.xml file ...[0m
   #+end_example

